app/mailers/success_mailer.rb

SELECT COUNT(*) FROM "treasure_hunts" WHERE "treasure_hunts"."winner" = $1  [["winner", true]]
---
  def winner(email)
    @usercount = (TreasureHunt.winners.size + 1).ordinalize