app/controllers/treasure_hunt_controller.rb

  def index
    render json: TreasureHunt.all, status: :ok
---
SELECT "treasure_hunts".* FROM "treasure_hunts"

  def create
    th = TreasureHunt.new(treasure_hunt_params)
    if th.save
---
INSERT INTO "treasure_hunts" ("latitude", "longitude", "email", "distance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["latitude", 50.051227], ["longitude", 19.945704], ["email", "a@a.com"], ["distance", 0.0], ["created_at", "2021-07-08 18:14:46.294897"], ["updated_at", "2021-07-08 18:14:46.294897"]]