app/models/treasure_hunt.rb

  def validate_request_limit
    errors.add(:base, 'Reached maximum request for an hour.') if TreasureHunt.request_for_an_hour(email).size >= 20
---
SELECT COUNT(*) FROM "treasure_hunts" WHERE "treasure_hunts"."email" = $1 AND "treasure_hunts"."created_at" BETWEEN $2 AND $3  [["email", "shravan007.c@gmail.com"], ["created_at", "2021-07-09 09:00:33.786721"], ["created_at", "2021-07-09 10:00:33.786748"]]